In [1]:
import pandas as pd

In [5]:
data = {'city': ['New York', 'Los Angeles', 'New York', 'Chicago', 'Los Angeles','Chichago','New York', 'Chichago'],
        'Purchase' : [1,0,1,0, 0,1, 1,0]}

In [6]:
df = pd.DataFrame(data)

In [7]:
df

          city  Purchase
0     New York         1
1  Los Angeles         0
2     New York         1
3      Chicago         0
4  Los Angeles         0
5     Chichago         1
6     New York         1
7     Chichago         0

In [10]:
#calculatin mean encoding

mean_encoding = df.groupby('city')['Purchase'].mean()
mean_encoding

city
Chicago        0.0
Chichago       0.5
Los Angeles    0.0
New York       1.0
Name: Purchase, dtype: float64

In [11]:
#map the mean values back to the original dataframe

df['City_Mean_encoded'] = df['city'].map(mean_encoding)

In [12]:
df

          city  Purchase  City_Mean_encoded
0     New York         1                1.0
1  Los Angeles         0                0.0
2     New York         1                1.0
3      Chicago         0                0.0
4  Los Angeles         0                0.0
5     Chichago         1                0.5
6     New York         1                1.0
7     Chichago         0                0.5

1.New York has a mean encoding of 1.00 because all customers from New York made a purchase.

2.Los Angeles has a mean encoding of 0.00 because none of the customers made a purchase.

3.Chicago has a mean encoding of 0.5 because only half of the customers made a purchase.